IdeaRS.Connections
SolidData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.SolidData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.AddedMemberData
 IdeaRS.Connections.Data.SolidData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SolidData : AddedMemberData
The SolidData type exposes the following members.
Constructors
Name | Description
SolidData
Initializes a new instance of the SolidData class
Top
Properties
Name | Description
AddedMemberLen1
 Gets or sets the first dimension of the segment
 (Inherited from AddedMemberData.)
AddedMemberLen2
 Gets or sets the first dimension of the segment
 (Inherited from AddedMemberData.)
AddedMemberPlateIndex
 Gets or sets the index of plate of added member, which is connected to related item.
 (Inherited from AddedMemberData.)
AddedMemberType |  (Inherited from AddedMemberData.)
AngleAlpha
 The angle between the reference line of the beam segment and plane XY
 (Inherited from AddedMemberData.)
AngleBeta
 The rotation around axis Z
 (Inherited from AddedMemberData.)
CoordSystem
 Data of the local coordinate system - Origin, AxisX, AxisY, AxisZ
 (Inherited from AddedMemberData.)
CrossSectionType |  (Inherited from AddedMemberData.)
CustomGeometry
 Gets or sets the custom geometrical data
 (Inherited from AddedMemberData.)
DefineBy
 Define by
 (Inherited from AddedMemberData.)
DirVectX
 Gets or sets X value of the direction vector of the beam segment
 (Inherited from AddedMemberData.)
DirVectY
 Gets or sets Y value of the direction vector of the beam segment
 (Inherited from AddedMemberData.)
DirVectZ
 Gets or sets Z value of the direction vector of the beam segment
 (Inherited from AddedMemberData.)
EccentricityBeginX
 Gets or sets the local eccentricity X at the begin of beam
 (Inherited from AddedMemberData.)
EccentricityBeginY
 Gets or sets the local eccentricity Y at the begin of beam
 (Inherited from AddedMemberData.)
EccentricityBeginZ
 Gets or sets the local eccentricity Z at the begin of beam
 (Inherited from AddedMemberData.)
InsertPointOnRefLine
 Gets or sets the relative position of the insertion point of added beam on the reference line.
 (Inherited from AddedMemberData.)
InsertPtX
 Gets or sets the X coordinate of the insertion point
 (Inherited from AddedMemberData.)
InsertPtY
 Gets or sets the Y coordinate of the insertion point
 (Inherited from AddedMemberData.)
InsertPtZ
 Gets or sets the Z coordinate of the insertion point
 (Inherited from AddedMemberData.)
IsActive |  (Inherited from ConnectionCmdData.)
LCSYVectX
 Gets or sets X value of the Y vector of the local coordinate system of the beam segment
 (Inherited from AddedMemberData.)
LCSYVectY
 Gets or sets Y value of the Y vector of the local coordinate system of the beam segment
 (Inherited from AddedMemberData.)
LCSYVectZ
 Gets or sets Z value of the Y vector of the local coordinate system of the beam segment
 (Inherited from AddedMemberData.)
LCSZVectX
 Gets or sets X value of the Z vector of the local coordinate system of the beam segment
 (Inherited from AddedMemberData.)
LCSZVectY
 Gets or sets Y value of the Z vector of the local coordinate system of the beam segment
 (Inherited from AddedMemberData.)
LCSZVectZ
 Gets or sets Z value of the Z vector of the local coordinate system of the beam segment
 (Inherited from AddedMemberData.)
Length
 Gets or sets the length of the segment
 (Inherited from AddedMemberData.)
LocLocation
 Gets or sets the side to mount - left side, right side.
 (Inherited from AddedMemberData.)
LocMemberPath
 Gets or sets the related member.
 (Inherited from AddedMemberData.)
LocPitch |  (Inherited from AddedMemberData.)
LocPlatePath
 Gets or sets of related plate of related member or directly related plate.
 (Inherited from AddedMemberData.)
LocRelatedTo
 Gets or sets the type of location of the added member. (Joint, member, plate)
 (Inherited from AddedMemberData.)
LocRotation |  (Inherited from AddedMemberData.)
LocType
 The type of mount of added member plate to related plate.
 (Inherited from AddedMemberData.)
LocXposition |  (Inherited from AddedMemberData.)
LocYposition |  (Inherited from AddedMemberData.)
MirrorY
 Mirror local axis Y
 (Inherited from AddedMemberData.)
MirrorZ
 Mirror local axis Z
 (Inherited from AddedMemberData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
 (Inherited from AddedMemberData.)
PlacementDefinition
 Added beam placement in Connection by Directional vector (and not by Spherical coordinates - aplha, beta, gamma angles) If value equals to DirectionVector the values of DirVectX, DirVectY, DirVectZ are expected
 (Inherited from AddedMemberData.)
PlateEdgeInx
 Gets or sets the plate edge index if widener loc type is selected.
 (Inherited from AddedMemberData.)
RotationRx
 Gets or sets the rotation of Cross-section about X axis of the of beam.
 (Inherited from AddedMemberData.)
Weld
 Gets or sets the properties of the connected member to added member weld
 (Inherited from AddedMemberData.)
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace